testes-jmeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="planoUnidade1">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupo UDP">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <longProp name="ThreadGroup.duration">10</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.samplers.UDPSampler guiclass="kg.apc.jmeter.samplers.UDPSamplerGui" testclass="kg.apc.jmeter.samplers.UDPSampler" testname="UDP writeLog">
          <stringProp name="hostname">localhost</stringProp>
          <stringProp name="port">9000</stringProp>
          <boolProp name="waitresponse">true</boolProp>
          <boolProp name="closechannel">false</boolProp>
          <stringProp name="timeout">5000</stringProp>
          <stringProp name="data">writeLog&#xd;
{&quot;eventId&quot;:&quot;evt-${__time(,ts)}&quot;,&quot;timestamp&quot;:${ts},&quot;type&quot;:&quot;LOBBY_ACTIVITY&quot;,&quot;action&quot;:&quot;ENTER&quot;,&quot;playerId&quot;:&quot;player-01&quot;,&quot;lobbyId&quot;:&quot;lobby-azul&quot;}</stringProp>
          <stringProp name="encodeclass">kg.apc.jmeter.samplers.UDPSampler</stringProp>
        </kg.apc.jmeter.samplers.UDPSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.samplers.UDPSampler guiclass="kg.apc.jmeter.samplers.UDPSamplerGui" testclass="kg.apc.jmeter.samplers.UDPSampler" testname="UDP readLog">
          <stringProp name="hostname">localhost</stringProp>
          <stringProp name="port">9000</stringProp>
          <boolProp name="waitresponse">true</boolProp>
          <boolProp name="closechannel">false</boolProp>
          <stringProp name="timeout">5000</stringProp>
          <stringProp name="data">readLog&#xd;
{&quot;startTimestamp&quot;:${__groovy((System.currentTimeMillis()-60000L).toString())},&quot;endTimestamp&quot;:${__groovy((System.currentTimeMillis()-10000L).toString())},&quot;eventType&quot;:&quot;LOBBY_ACTIVITY&quot;}</stringProp>
          <stringProp name="encodeclass">kg.apc.jmeter.samplers.UDPSampler</stringProp>
        </kg.apc.jmeter.samplers.UDPSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.samplers.UDPSampler guiclass="kg.apc.jmeter.samplers.UDPSamplerGui" testclass="kg.apc.jmeter.samplers.UDPSampler" testname="UDP gatewayPing">
          <stringProp name="hostname">localhost</stringProp>
          <stringProp name="port">9000</stringProp>
          <boolProp name="waitresponse">true</boolProp>
          <boolProp name="closechannel">false</boolProp>
          <stringProp name="timeout">5000</stringProp>
          <stringProp name="data">gatewayPing&#xd;
{&quot;source&quot;:&quot;jmeter&quot;,&quot;msg&quot;:&quot;teste ping&quot;,&quot;ts&quot;:${__time(,pingTs)}}</stringProp>
          <stringProp name="encodeclass">kg.apc.jmeter.samplers.UDPSampler</stringProp>
        </kg.apc.jmeter.samplers.UDPSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">500</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
        <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
        </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupo ping gateway">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <longProp name="ThreadGroup.duration">10</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.samplers.UDPSampler guiclass="kg.apc.jmeter.samplers.UDPSamplerGui" testclass="kg.apc.jmeter.samplers.UDPSampler" testname="UDP gatewayPing">
          <stringProp name="hostname">localhost</stringProp>
          <stringProp name="port">9000</stringProp>
          <boolProp name="waitresponse">true</boolProp>
          <boolProp name="closechannel">false</boolProp>
          <stringProp name="timeout">5000</stringProp>
          <stringProp name="data">gatewayPing</stringProp>
          <stringProp name="encodeclass">kg.apc.jmeter.samplers.UDPSampler</stringProp>
        </kg.apc.jmeter.samplers.UDPSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>